1atabey1/esp32tricore-dap/main/network/web_server.c
    return httpd_resp_send(req, (const char *)help_start, help_size);
}

esp_err_t website_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    extern const unsigned char website_html_start[] asm("_binary_website_html_start");
    extern const unsigned char website_html_end[]   asm("_binary_website_html_end");
    const size_t website_html_size = (website_html_end - website_html_start);

    return httpd_resp_send(req, (const char *)website_html_start, website_html_size);
}

esp_err_t ez32_handler(httpd_req_t *req)
{
    extern const unsigned char ez32_svg_start[] asm("_binary_ez32_svg_start");
    extern const unsigned char ez32_svg_end[]   asm("_binary_ez32_svg_end");
    const size_t ez32_size = (ez32_svg_end - ez32_svg_start);

    httpd_resp_set_type(req, "image/svg+xml");

    return httpd_resp_send(req, (const char *)ez32_svg_start, ez32_size);
}

esp_err_t favicon_handler(httpd_req_t *req)
{
    extern const unsigned char favicon_ico_start[] asm("_binary_favicon_ico_start");
    extern const unsigned char favicon_ico_end[]   asm("_binary_favicon_ico_end");
    const size_t favicon_ico_size = (favicon_ico_end - favicon_ico_start);

    httpd_resp_set_type(req, "image/x-icon");

    return httpd_resp_send(req, (const char *)favicon_ico_start, favicon_ico_size);
}

static cJSON *set_handler_start(httpd_req_t *req, char *json_buf, uint32_t json_buf_sz)
{
    memset(json_buf, 0x00, json_buf_sz);

    /* Read data received in the request */
    int ret = httpd_req_recv(req, json_buf, json_buf_sz);
    if (ret <= 0) {
        if (ret == HTTPD_SOCK_ERR_TIMEOUT) {
            httpd_resp_send_408(req);
        }
        return NULL;
    }

    ESP_LOGI(TAG, "json : %s", json_buf);

    cJSON *root = cJSON_ParseWithLength(json_buf, json_buf_sz);
    if (root == NULL) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Json parse error");
        return NULL;
    }
    return root;
}

#ifdef FPGA_CFG_TEST
// Define a buffer size for reading chunks of data
#define BUFF_SIZE 1024

// This is the main handler function for your file upload
static esp_err_t fpga_loader_handler(httpd_req_t *req) {
    //esp_err_t err = ESP_OK;
    char *buf = NULL;
    int remaining = req->content_len;
    int received_bytes = 0;
    
    // --- Header and Boundary Parsing ---
    size_t len = httpd_req_get_hdr_value_len(req, "Content-Type");
    if (len == 0) {
        ESP_LOGE("FPGA_LOADER", "Content-Type header not found");
        return ESP_FAIL;
    }
    
    char *ctype_hdr = (char *)malloc(len + 1);
    if (ctype_hdr == NULL) {
        ESP_LOGE("FPGA_LOADER", "Failed to allocate memory for ctype header");
        return ESP_FAIL;
    }
    
    httpd_req_get_hdr_value_str(req, "Content-Type", ctype_hdr, len + 1);

    
    char *boundary_str = strstr(ctype_hdr, "boundary=");
    if (boundary_str == NULL) {
        ESP_LOGE("FPGA_LOADER", "Boundary not found in Content-Type header");
        free(ctype_hdr);
        return ESP_FAIL;
    }
    
    boundary_str += strlen("boundary=");

    ESP_LOGI("FPGA_LOADER", "boundary_str =%s ctype_hdr=%s len=%d",boundary_str, ctype_hdr,len); 
#if 0
    char boundary_line[128];
    sprintf(boundary_line, "--%s\r\n", boundary_str);
    //size_t boundary_line_len = strlen(boundary_line);

    char boundary_end[128];
    sprintf(boundary_end, "--%s--\r\n", boundary_str);
    //size_t boundary_end_len = strlen(boundary_end);
#endif
    free(ctype_hdr);

    // Read the request body to find the file data
    buf = (char *)malloc(BUFF_SIZE);
    if (buf == NULL) {
        ESP_LOGE("FPGA_LOADER", "Failed to allocate buffer");
        return ESP_FAIL;
    }

    // --- Find the Start of the File Data ---
    int read_bytes = httpd_req_recv(req, buf, BUFF_SIZE);
    if (read_bytes <= 0) {
        ESP_LOGE("FPGA_LOADER", "No data received");
        free(buf);
        return ESP_FAIL;
    }
   /* 
    char *start_data = strstr(buf, "\r\n\r\n");
    if (start_data == NULL) {
        ESP_LOGE("FPGA_LOADER", "Start of file data not found");
        free(buf);
        return ESP_FAIL;
    }
    */
    char *start_data = NULL;
    for (int i = 0; i <= read_bytes - 4; ++i) {
        if (memcmp(buf + i, "\r\n\r\n", 4) == 0) {
            start_data = buf + i;
            ESP_LOGI("FPGA_LOADER_a1", "Found start_data");
            break;
        }
    }

    int total_wr = 0;
    // Pointer to the first byte of the file data
    start_data += 4; // Move past the \r\n\r\n

    int bytes_to_write = read_bytes - (start_data - buf);
    /*
    Yes 👍 this line is perfectly valid C, as long as:
    psram_buffer points to a memory region large enough to hold bytes_to_write bytes.
    buf points to at least bytes_to_write valid bytes of source data.
    bytes_to_write is non-negative (well, since it’s size_t, it’s unsigned).*/
    memcpy(psram_buffer+total_wr, start_data, bytes_to_write);

    total_wr += bytes_to_write;

    remaining -= read_bytes;
    received_bytes += bytes_to_write;

    ESP_LOGI(TAG, "remaining=%d received_bytes=%d  bytes_to_write=%d", remaining, received_bytes,  bytes_to_write); 
    //if(bytes_to_write>64){
    //    for(int i =0;i<64;++i){
    //        ESP_LOGI(TAG, "%02x ",psram_buffer[i]);
    //    }
    //}

    char *final_boundary= "------WebKitFormBoundary";
    //sprintf(final_boundary, "%s", "------WebKitFormBoundary");
    size_t final_boundary_len = strlen(final_boundary);

    // --- Continue Reading and Writing the Rest of the File ---
    while (remaining > 0) {
        read_bytes = httpd_req_recv(req, buf, MIN(BUFF_SIZE, remaining));
        if (read_bytes <= 0) {
            ESP_LOGE("FPGA_LOADER", "Failed to receive data from client");
            free(buf);
            return ESP_FAIL;
        }

        //char *end_of_data_pos = strstr(buf, final_boundary);
        //char *end_of_data_pos = strstr(buf, "WebKitFormBoundary");
        //char *end_of_data_pos = strstr(buf, "----");
        //char *end_of_data_pos = strstr(buf, "\x2d\x2d\x2d\x2d\x2d\x2d");
        // Correct approach using a for loop and memcmp
        char *end_of_data_pos = NULL;
        for (int i = 0; i <= read_bytes - final_boundary_len; ++i) {
            if (memcmp(buf + i, final_boundary, final_boundary_len ) == 0) {
                end_of_data_pos = buf + i;
                ESP_LOGI("FPGA_LOADER_aa", "Found end boundary");
                break;
            }
        }
        
