1atabey1/esp32tricore-dap/main/network/web_server.c
    cJSON_Delete(root);

    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, "{\"status\": \"ok\"}");

    return ESP_OK;
}

static esp_err_t la_get_settings_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;

    const char *trigger_names[] = {"disabled", "rising", "falling", "crossing", "high", "low"};

    cJSON *root = cJSON_CreateObject();
    cJSON_AddNumberToObject(root, "sampleRate",    gbl_sample_rate);
    cJSON_AddBoolToObject  (root, "triggerEnabled", gbl_trigger_enabled);
    cJSON_AddBoolToObject  (root, "triggerModeOR",  gbl_trigger_mode_or);
    cJSON_AddBoolToObject  (root, "captureInternalTestSignal", gbl_capture_internal_test_signal);
    cJSON_AddBoolToObject  (root, "measureMode", gbl_la_measure_mode);
    cJSON_AddNumberToObject(root, "triggerPosition", gbl_trigger_position);

    cJSON *channels = cJSON_CreateArray();
    for (int i = 0; i < 16; i++) {
        int t = (int)gbl_channel_triggers[i];
        const char *name = (t >= 0 && t <= 5) ? trigger_names[t] : "disabled";
        cJSON_AddItemToArray(channels, cJSON_CreateString(name));
    }
    cJSON_AddItemToObject(root, "channels", channels);

    char *json_str = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);

    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, json_str, HTTPD_RESP_USE_STRLEN);
    free(json_str);

    return ESP_OK;
}

/* POST /api/portd_output
 * Body: {"mode": 0-3, "value": 0-15}
 * mode 0=tristate, 1=counter_lo, 2=counter_hi, 3=gpio
 * Requires Port D configured as Logic Analyzer (not XVC). */
static esp_err_t portd_output_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;

    cJSON *root = cJSON_CreateObject();

    if (gbl_pd_cfg != PD_LOGICANALYZER) {
        cJSON_AddStringToObject(root, "status",  "error");
        cJSON_AddStringToObject(root, "message", "Port D must be configured as Logic Analyzer (not XVC)");
        char *js = cJSON_PrintUnformatted(root);
        cJSON_Delete(root);
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_set_type(req, "application/json");
        httpd_resp_sendstr(req, js);
        free(js);
        return ESP_OK;
    }

    char buf[128] = {0};
    int received = httpd_req_recv(req, buf, sizeof(buf) - 1);
    if (received <= 0) {
        cJSON_AddStringToObject(root, "status",  "error");
        cJSON_AddStringToObject(root, "message", "Empty or invalid body");
        char *js = cJSON_PrintUnformatted(root);
        cJSON_Delete(root);
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_set_type(req, "application/json");
        httpd_resp_sendstr(req, js);
        free(js);
        return ESP_OK;
    }

    cJSON *body = cJSON_Parse(buf);
    uint8_t mode  = PORTD_OUT_TRISTATE;
    uint8_t value = 0;
    if (body) {
        cJSON *m = cJSON_GetObjectItem(body, "mode");
        cJSON *v = cJSON_GetObjectItem(body, "value");
        if (cJSON_IsNumber(m)) mode  = (uint8_t)(m->valueint & 0x3);
        if (cJSON_IsNumber(v)) value = (uint8_t)(v->valueint & 0xF);
        cJSON_Delete(body);
    }

    set_portd_output(mode, value);

    static const char *mode_names[] = {"tristate", "counter_lo", "counter_hi", "gpio"};
    cJSON_AddStringToObject(root, "status", "ok");
    cJSON_AddStringToObject(root, "mode",   mode_names[mode]);
    cJSON_AddNumberToObject(root, "value",  value);
    char *js = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, js);
    free(js);
    return ESP_OK;
}

static esp_err_t sreset_config_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    char json_buf[128];
    cJSON *root = set_handler_start(req, json_buf, sizeof(json_buf));
    if (!root) return ESP_FAIL;

    cJSON *polarity = cJSON_GetObjectItem(root, "polarity");
    cJSON *pulse_ms = cJSON_GetObjectItem(root, "pulse_ms");

    if (polarity && cJSON_IsNumber(polarity)) {
        gbl_sreset_polarity = (polarity->valueint != 0) ? 1 : 0;
    }
    if (pulse_ms && cJSON_IsNumber(pulse_ms)) {
        int ms = pulse_ms->valueint;
        if (ms >= 1 && ms <= 5000) {
            gbl_sreset_pulse_ms = (uint32_t)ms;
        } else {
            cJSON_Delete(root);
            httpd_resp_set_status(req, "400 Bad Request");
            httpd_resp_set_type(req, "application/json");
            httpd_resp_sendstr(req, "{\"status\":\"error\",\"message\":\"pulse_ms must be 1–5000\"}");
            return ESP_OK;
        }
    }
    cJSON_Delete(root);

    /* A polarity change also changes the electrical idle level. Apply the
     * inactive state immediately so the target is never left asserted. */
    set_sreset(false);

    ESP_LOGI(TAG, "sreset_config: polarity=%d pulse_ms=%lu",
             gbl_sreset_polarity, (unsigned long)gbl_sreset_pulse_ms);

    char resp[64];
    snprintf(resp, sizeof(resp),
             "{\"status\":\"ok\",\"polarity\":%d,\"pulse_ms\":%lu}",
             gbl_sreset_polarity, (unsigned long)gbl_sreset_pulse_ms);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, resp);
    return ESP_OK;
}

static esp_err_t reset_target_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;

    cJSON *root = cJSON_CreateObject();

    if (gbl_pb_cfg != PB_UART_SRESET_VTARGET) {
        cJSON_AddStringToObject(root, "status",  "error");
        cJSON_AddStringToObject(root, "message", "Port B must be configured as Vtarget+UART+SReset");
        char *js = cJSON_PrintUnformatted(root);
        cJSON_Delete(root);
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_set_type(req, "application/json");
        httpd_resp_sendstr(req, js);
        free(js);
        return ESP_OK;
    }

    /* set_sreset() accepts a logical asserted state and applies polarity. */
    set_sreset(true);
    vTaskDelay(pdMS_TO_TICKS(gbl_sreset_pulse_ms));
    set_sreset(false);

    char msg[64];
    snprintf(msg, sizeof(msg), "Reset pulse sent (%lu ms, %s)",
             (unsigned long)gbl_sreset_pulse_ms,
             gbl_sreset_polarity ? "active LOW" : "active HIGH");

    cJSON_AddStringToObject(root, "status",  "ok");
    cJSON_AddStringToObject(root, "message", msg);
    char *js = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, js);
    free(js);
    return ESP_OK;
}

static esp_err_t uart_debug_handler(httpd_req_t *req)
{
    char json[512];

    if (check_auth(req) != ESP_OK) return ESP_OK;

