1atabey1/esp32tricore-dap/main/network/web_server.c
        dap_trace_stats_t st;
        dap_trace_get_stats(&st);
        if (!st.running && idle > DAP_TRACE_DRAIN_TAIL_PASSES) {
            break;                      /* stopped, and the ring has run dry */
        }
        if (idle > DAP_TRACE_IDLE_PASSES || esp_timer_get_time() >= deadline) {
            break;                      /* nothing arriving; do not hold the server */
        }
        idle++;
        vTaskDelay(pdMS_TO_TICKS(5));
    }
    free(buf);
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
}

/*
 * GET /api/dap_gdb/start  - attach and start the TriCore GDB server
 * GET /api/dap_gdb/stop
 * GET /api/dap_gdb/status
 *
 * Started on request rather than at boot, and on 4243 rather than 4242, because
 * Black Magic's own GDB server is already listening on 4242 and drives the same
 * Port C pins.  The two cannot both be attached; having them both start
 * automatically would mean whichever GDB connected first silently won.
 */
static esp_err_t dap_gdb_start_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    dap_capture_begin();
    const esp_err_t err = gdb_rsp_start(GDB_RSP_DEFAULT_PORT);
    char verdict[128];
    snprintf(verdict, sizeof(verdict), "\n=== %s ===\n",
             err == ESP_OK ? "GDB server listening; target remote <board>:4243"
                           : "could not start the GDB server");
    dap_capture_end(req, verdict);
    return ESP_OK;
}

static esp_err_t dap_gdb_stop_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    gdb_rsp_stop();
    httpd_resp_set_type(req, "text/plain");
    httpd_resp_sendstr(req, "stopping\n");
    return ESP_OK;
}

static esp_err_t dap_gdb_status_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    char line[160];
    const int n = snprintf(line, sizeof(line),
        "running=%d connected=%d port=%u cores=%d\n",
        gdb_rsp_running() ? 1 : 0, gdb_rsp_connected() ? 1 : 0,
        gdb_rsp_port(), tricore_core_count());

    httpd_resp_set_type(req, "text/plain");
    httpd_resp_send(req, line, (n > 0) ? (size_t)n : 0);
    return ESP_OK;
}

httpd_uri_t uri_dap_gdb_start = {
    .uri      = "/api/dap_gdb/start",
    .method   = HTTP_GET,
    .handler  = dap_gdb_start_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_gdb_stop = {
    .uri      = "/api/dap_gdb/stop",
    .method   = HTTP_GET,
    .handler  = dap_gdb_stop_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_gdb_status = {
    .uri      = "/api/dap_gdb/status",
    .method   = HTTP_GET,
    .handler  = dap_gdb_status_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_trace_start = {
    .uri      = "/api/dap_trace/start",
    .method   = HTTP_GET,
    .handler  = dap_trace_start_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_trace_stop = {
    .uri      = "/api/dap_trace/stop",
    .method   = HTTP_GET,
    .handler  = dap_trace_stop_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_trace_stats = {
    .uri      = "/api/dap_trace/stats",
    .method   = HTTP_GET,
    .handler  = dap_trace_stats_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_trace_stream = {
    .uri      = "/api/dap_trace/stream",
    .method   = HTTP_GET,
    .handler  = dap_trace_stream_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_spi = {
    .uri      = "/api/dap_spi",
    .method   = HTTP_GET,
    .handler  = dap_spi_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_dap_bringup = {
    .uri      = "/api/dap_bringup",
    .method   = HTTP_GET,
    .handler  = dap_bringup_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_reset_to_factory = {
    .uri       = "/reset_to_factory",
    .method    = HTTP_POST,
    .handler   = reset_to_factory_handler,
    .user_ctx  = NULL
};

httpd_uri_t uri_ota_upload = {
    .uri      = "/ota_upload",
    .method   = HTTP_POST,
#ifndef FPGA_CFG_TEST 
    .handler  = ota_upload_handler,
#else
    .handler  = fpga_loader_handler,
#endif
    .user_ctx = NULL
};

httpd_uri_t uri_get_main_page = {
    .uri = "/",
    .method = HTTP_GET,
    .handler = website_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_get_logo = {
    .uri = "/ez32.svg",
    .method = HTTP_GET,
    .handler = ez32_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_get_favicon = {
    .uri = "/favicon.ico",
    .method = HTTP_GET,
    .handler = favicon_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_set_credentials = {
    .uri = "/set_credentials",
    .method = HTTP_POST,
    .handler = set_credentials_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_get_credentials = {
    .uri = "/get_credentials",
    .method = HTTP_GET,
    .handler = get_credentials_handler,
    .user_ctx = NULL
};


httpd_uri_t uri_file_upload = {
    .uri       = "/upload/*",
    .method    = HTTP_POST,
    .handler   = file_upload_handler,
    .user_ctx  = NULL
};

httpd_uri_t uri_file_delete = {
    .uri       = "/delete/*",
    .method    = HTTP_POST,
    .handler   = file_delete_handler,
    .user_ctx  = NULL
};

httpd_uri_t uri_logic_analyzer = {
    .uri = "/logic_analyzer.html",
    .method = HTTP_GET,
    .handler = logic_analyzer_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_help = {
    .uri = "/help",
    .method = HTTP_GET,
    .handler = help_handler,
    .user_ctx = NULL
};
/*
httpd_uri_t uri_logic_analyzer_data = {
    .uri = "/logic_analyzer_data",
    .method = HTTP_GET,
    .handler = logic_analyzer_data_handler,
    .user_ctx = NULL
};
*/
httpd_uri_t uri_log_error = {
    .uri = "/log_error",
    .method = HTTP_POST,
    .handler = log_error_handler,
    .user_ctx = NULL
};

esp_err_t not_found_handler(httpd_req_t *req, httpd_err_code_t err_code)
{
    httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "The requested URI was not found on this server.");
    return ESP_OK;
}

httpd_uri_t uri_capture_data= {
    .uri = "/capture_data",
    .method = HTTP_GET,
    .handler = capture_data_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_status = {
    .uri      = "/la_status",
    .method   = HTTP_GET,
    .handler  = la_status_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_instant_capture = {
    .uri      = "/instant_capture",
    .method   = HTTP_GET,
    .handler  = la_instant_capture_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_start_capture = {
    .uri      = "/la_start_capture",
    .method   = HTTP_GET,
    .handler  = la_start_capture_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_configure = {
    .uri      = "/la_configure",
    .method   = HTTP_POST,
    .handler  = la_configure_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_get_settings = {
    .uri      = "/la_get_settings",
    .method   = HTTP_GET,
    .handler  = la_get_settings_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_version = {
    .uri      = "/api/version",
    .method   = HTTP_GET,
    .handler  = version_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_reset_target = {
    .uri      = "/api/reset_target",
    .method   = HTTP_POST,
    .handler  = reset_target_handler,
    .user_ctx = NULL
};

