1atabey1/esp32tricore-dap/main/network/web_server.c
httpd_uri_t uri_uart_debug = {
    .uri      = "/api/uart_debug",
    .method   = HTTP_GET,
    .handler  = uart_debug_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_sreset_config = {
    .uri      = "/api/sreset_config",
    .method   = HTTP_POST,
    .handler  = sreset_config_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_portd_output = {
    .uri      = "/api/portd_output",
    .method   = HTTP_POST,
    .handler  = portd_output_handler,
    .user_ctx = NULL
};

/* POST /api/portd_freq
 * Body: {"freq_hz": 0|125|250|500|1000}
 * Starts a square-wave toggle on Port D pins 0-3.  freq_hz=0 stops and
 * tristates.  Requires Port D in Logic Analyzer mode (not XVC). */
static esp_err_t portd_freq_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    cJSON *root = cJSON_CreateObject();

    if (gbl_pd_cfg != PD_LOGICANALYZER) {
        cJSON_AddStringToObject(root, "status",  "error");
        cJSON_AddStringToObject(root, "message", "Port D must be configured as Logic Analyzer (not XVC)");
        char *js = cJSON_PrintUnformatted(root);
        cJSON_Delete(root);
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_set_type(req, "application/json");
        httpd_resp_sendstr(req, js);
        free(js);
        return ESP_OK;
    }

    char buf[128] = {0};
    int received = httpd_req_recv(req, buf, sizeof(buf) - 1);
    if (received <= 0) {
        cJSON_AddStringToObject(root, "status",  "error");
        cJSON_AddStringToObject(root, "message", "Empty body");
        char *js = cJSON_PrintUnformatted(root);
        cJSON_Delete(root);
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_set_type(req, "application/json");
        httpd_resp_sendstr(req, js);
        free(js);
        return ESP_OK;
    }

    cJSON *body = cJSON_Parse(buf);
    uint32_t freq_hz = 0;
    if (body) {
        cJSON *f = cJSON_GetObjectItem(body, "freq_hz");
        if (cJSON_IsNumber(f)) freq_hz = (uint32_t)f->valueint;
        cJSON_Delete(body);
    }

    if (freq_hz != 0 && freq_hz != 125 && freq_hz != 250 && freq_hz != 500 && freq_hz != 1000) {
        cJSON_AddStringToObject(root, "status",  "error");
        cJSON_AddStringToObject(root, "message", "Invalid freq_hz — valid: 0, 125, 250, 500, 1000");
        char *js = cJSON_PrintUnformatted(root);
        cJSON_Delete(root);
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_set_type(req, "application/json");
        httpd_resp_sendstr(req, js);
        free(js);
        return ESP_OK;
    }

    set_portd_freq(freq_hz);

    cJSON_AddStringToObject(root, "status", "ok");
    cJSON_AddNumberToObject(root, "freq_hz", (double)freq_hz);
    char *js = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, js);
    free(js);
    return ESP_OK;
}

httpd_uri_t uri_portd_freq = {
    .uri      = "/api/portd_freq",
    .method   = HTTP_POST,
    .handler  = portd_freq_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_test_start = {
    .uri      = "/test/start",
    .method   = HTTP_POST,
    .handler  = test_start_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_test_status = {
    .uri      = "/test/status",
    .method   = HTTP_GET,
    .handler  = test_status_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_test_result = {
    .uri      = "/test/result",
    .method   = HTTP_GET,
    .handler  = test_result_handler,
    .user_ctx = NULL
};

#include "esp_https_server.h"

extern const unsigned char cacert_pem_start[] asm("_binary_cacert_pem_start");
extern const unsigned char cacert_pem_end[]   asm("_binary_cacert_pem_end");
extern const unsigned char prvtkey_pem_start[] asm("_binary_prvtkey_pem_start");
extern const unsigned char prvtkey_pem_end[]   asm("_binary_prvtkey_pem_end");

esp_err_t web_server_start(httpd_handle_t *http_handle) {
    httpd_ssl_config_t config = HTTPD_SSL_CONFIG_DEFAULT();

    // Note: mbedtls requires PEM to be null-terminated. Embedded files might not be.
    // We allocate a buffer, copy, and adhere to requirements.
    
    size_t cacert_len = cacert_pem_end - cacert_pem_start;
    size_t prvtkey_len = prvtkey_pem_end - prvtkey_pem_start;

    // Allocate buffers with space for \0
    uint8_t *cacert_buf = calloc(1, cacert_len + 1);
    uint8_t *prvtkey_buf = calloc(1, prvtkey_len + 1);

    if (!cacert_buf || !prvtkey_buf) {
        ESP_LOGE(TAG, "Failed to allocate memory for SSL certs");
        free(cacert_buf);
        free(prvtkey_buf);
        return ESP_ERR_NO_MEM;
    }

    memcpy(cacert_buf, cacert_pem_start, cacert_len);
    cacert_buf[cacert_len] = '\0';

    memcpy(prvtkey_buf, prvtkey_pem_start, prvtkey_len);
    prvtkey_buf[prvtkey_len] = '\0';

    config.servercert = cacert_buf;
    config.servercert_len = cacert_len + 1; // Include null terminator
    config.prvtkey_pem = prvtkey_buf;
    config.prvtkey_len = prvtkey_len + 1; // Include null terminator

    /*
     * 33 handlers are registered below, and httpd_register_uri_handler()
     * returns an error rather than complaining loudly when the table is full -
     * so a cap set too low takes the *last* endpoints registered off the air
     * with no sign of it but a 404.  Kept well clear of the count.
     */
    config.httpd.max_uri_handlers = 40;
    config.httpd.stack_size = 10240; // Increased stack for SSL operations

    ESP_LOGI(TAG, "Starting HTTPS Server on port: '%d'", config.httpd.server_port);
    esp_err_t ret = httpd_ssl_start(http_handle, &config);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start web server! Error: %d", ret);
    }

    httpd_register_uri_handler(*http_handle, &uri_get_main_page);
    httpd_register_uri_handler(*http_handle, &uri_get_logo);
    httpd_register_uri_handler(*http_handle, &uri_get_favicon);
    httpd_register_uri_handler(*http_handle, &uri_set_credentials);
    httpd_register_uri_handler(*http_handle, &uri_get_credentials);
    httpd_register_uri_handler(*http_handle, &uri_file_upload);
    httpd_register_uri_handler(*http_handle, &uri_file_delete);
    httpd_register_uri_handler(*http_handle, &uri_logic_analyzer);
    httpd_register_uri_handler(*http_handle, &uri_help);
    //httpd_register_uri_handler(*http_handle, &uri_logic_analyzer_data);
    httpd_register_uri_handler(*http_handle, &uri_log_error);
    httpd_register_uri_handler(*http_handle, &uri_ota_upload);
    httpd_register_uri_handler(*http_handle, &uri_reset_to_factory);
    httpd_register_uri_handler(*http_handle, &uri_dap_spi);
    httpd_register_uri_handler(*http_handle, &uri_dap_trace_start);
    httpd_register_uri_handler(*http_handle, &uri_dap_trace_stop);
    httpd_register_uri_handler(*http_handle, &uri_dap_trace_stats);
    httpd_register_uri_handler(*http_handle, &uri_dap_trace_stream);
    httpd_register_uri_handler(*http_handle, &uri_dap_gdb_start);
    httpd_register_uri_handler(*http_handle, &uri_dap_gdb_stop);
    httpd_register_uri_handler(*http_handle, &uri_dap_gdb_status);
    httpd_register_uri_handler(*http_handle, &uri_dap_bringup);

    httpd_register_err_handler(*http_handle, HTTPD_404_NOT_FOUND, not_found_handler);
    ESP_ERROR_CHECK(uart_websocket_add_handlers(*http_handle));

    httpd_register_uri_handler(*http_handle, &uri_la_start_capture);
    httpd_register_uri_handler(*http_handle, &uri_la_status);
    httpd_register_uri_handler(*http_handle, &uri_la_instant_capture);
    httpd_register_uri_handler(*http_handle, &uri_capture_data);
    httpd_register_uri_handler(*http_handle, &uri_la_configure);
    httpd_register_uri_handler(*http_handle, &uri_la_get_settings);
    httpd_register_uri_handler(*http_handle, &uri_version);
    httpd_register_uri_handler(*http_handle, &uri_reset_target);
    httpd_register_uri_handler(*http_handle, &uri_uart_debug);
    httpd_register_uri_handler(*http_handle, &uri_sreset_config);
    httpd_register_uri_handler(*http_handle, &uri_portd_output);
    httpd_register_uri_handler(*http_handle, &uri_portd_freq);

    // Test automation endpoints
    httpd_register_uri_handler(*http_handle, &uri_test_start);
    httpd_register_uri_handler(*http_handle, &uri_test_status);
    httpd_register_uri_handler(*http_handle, &uri_test_result);
    
    // We cannot free the buffers here if httpd_ssl_start uses them by reference!
    // Documentation for httpd_ssl_start isn't explicit if it copies.
    // However, usually mbedtls parses it into its own context.
    // BUT httpd server keeps the config struct?
    // Actually, checking standard implementation: httpd_ssl_start creates a session and usually the context persists.
    // If we free it, and it accessed it later (e.g. for new connections/re-handshake), crash.
    // Given this is the global web server, leaking 2-3KB once is acceptable vs crashing.
    // So we do NOT free them.
    
    return ret;
}
